
public class Ex3 {

	public static void main(String[] args) {
		/*
		 * 기본 데이터타입(기본형, Primitive Type)
		 * 메모리의 효율적인 사용을 위해 사이즈별로 나누어놓음
		 * - 자바에서 기본적으로 사용하는 데이터타입 8가지
		 * 
		 * 		  	    1Byte     2Byte     4Byte    8Byte
		 *              = 8bit
		 * --------------------------------------------------
		 * 1. 정수형 :  byte	  short	    int      long
		 * 2. 실수형 :  				    float    double
		 * 3. 문자형 :            char
		 * 4. 논리형 :  boolean
		 * --------------------------------------------------
		 * 정수형 데이터타입 변수에 저장 가능한 정수 범위 : -2^(n-1) ~ 2^(n-1)-1
		 * byte 타입 : -2^7 ~ 2^7-1 = -128 ~ 127 까지 표현 가능
		 * short 타입 : -2^15 ~ 2^15-1 = -32768 ~ 32767 까지 표현 가능
		 * int 타입 : -2^31 ~ 2^31-1 = -21억 ~ 21억 까지 표현 가능
		 * long 타입 : -2^63 ~ 2^63-1 = -922경 ~ 922경 까지 표현 가능
		 * --------------------------------------------------
		 * 이거 두 개는 외울 필요는 없음. 정수 타입 보다 큰 표현이 가능하단것만 알기!
		 * float 타입(4Byte) : 약 ±10^38 까지 표현 가능(long 타입 보다 큰 정수 표현도 가능)
		 * double 타입(8Byte) : 약 ±10^308 까지 표현 가능
		 * => 결론! 실수형 데이터타입은 정수형 데이터타입보다 큰 타입으로 취급됨
		 * 
		 */
		
		byte b = 127;
		System.out.println(b);
		
//		b = 128; // 오류! byte 타입 변수에는 -128 ~ 127 까지의 정수만 저장 가능
		
		short s = 128;
		System.out.println(s);
		
//		s = 32768; // 오류! short 타입 변수에는 -32768 ~ 32767 까지의 정수만 저장 가능
		
		int i = 32768;
		System.out.println(i);
		
//		i = 2147483648; // 정수 리터럴에 접미사가 없을 경우 int형 정수로 취급되며
						// 최대 표현 가능한 숫자가 2147483647 까지이다!
						// 따라서, 그 이상의 숫자를 표현하려면
						// 접미사 L을 붙여서 long 타입을 사용해야한다!
		
//		i = 2147483648L; // 오류! long 타입 정수를 int 타입 변수에 저장 불가!
		
		long l = 2147483648L;
//		l = 2147483648; // 오류! long 타입은 접미사 L 붙여줘야함!
		System.out.println(l);
		
		l = 100L;
//		i = 100L; // 접미사 L 이 붙으면 int 타입으로 저장 가능한 숫자라 하더라도 저장 불가!
		
		// -----------------------------------------------------------------------
		
		float f = 3.14f;
//		f = 3.14; // 오류! float 타입은 접미사 f 또는 F 를 붙여줘야함!
		System.out.println(f);
		
		double d = 3.14;
		System.out.println(d);
		
		// -----------------------------------------------------------------------
		
		char c = 'A';
//		c = 'AB'; // 오류! char 타입은 1개의 문자만 사용 가능!
//		c = ''; // 오류! char 타입은 "무조건" 1개의 문자 사용!
		System.out.println(c);
		
		// -----------------------------------------------------------------------
		
		boolean bool = true;
//		bool = TRUE; // 오류! 대문자 TRUE 는 true 랑 구분된다! 예약어에 해당하지 않음!
//		bool = True; // 오류! True 역시 위와 같은 이유!
		System.out.println(bool);
		
		bool = false;
		System.out.println(bool);
		
	}
	
}


















